app/notifications/comment_notification.rb

  def message
    @post = Post.find(params[:comment][:post_id])
    @user = User.find(params[:comment][:user_id])
    @comment = Comment.find(params[:comment][:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]