app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["created_at", "2023-10-06 12:05:54.160243"], ["updated_at", "2023-10-06 12:05:54.160243"]]
UPDATE "comments" SET "updated_at" = ? WHERE "comments"."id" = ?  [["updated_at", "2023-10-06 12:05:54.183349"], ["id", 1]]
---
    def create
        @comment = @post.comments.create(comment_params)
        @comment.user = current_user

        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "comments" SET "updated_at" = ? WHERE "comments"."id" = ?  [["updated_at", "2023-10-08 07:31:17.012092"], ["id", 2]]
---
    def update
        @comment =  @post.comments.find(params[:id])
        if @comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 2], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
    def destroy
        if @post.comments.find(params[:id]).destroy