app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 2]]
UPDATE "posts" SET "updated_at" = ?, "views" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-10-06 18:05:41.723180"], ["views", 1], ["id", 1]]
---
  def show
    @comments = @post.comments.order(created_at: :desc)
    @post.update(views: @post.views + 1)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "views", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "First Post"], ["body", "First Post Body"], ["created_at", "2023-10-06 18:05:41.614490"], ["updated_at", "2023-10-06 18:05:41.614490"], ["views", 0], ["user_id", 1]]
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "notifications" SET "read_at" = ? WHERE (json_extract(params, '$.post') = '{"_aj_globalid":"gid://modern-blog/Post/1"}') AND "notifications"."recipient_type" = ? AND "notifications"."recipient_id" = ?  [["read_at", "2023-10-08 14:30:33.578687"], ["recipient_type", "User"], ["recipient_id", 2]]
---
    def mark_notification_as_read
      puts "Current user is #{current_user.email} and the Post user is #{@post.user.email}"
      if current_user
        notifications_to_mark_as_read = @post.notifications_as_post.where(recipient: current_user)
        notifications_to_mark_as_read.update_all(read_at: Time.zone.now)