app/controllers/search_controller.rb

    def set_query
      if params[:q]
        @q = Post.ransack(params[:q])
        @posts = @q.result

      else
        @q = Post.ransack({})
        @posts = Post.all
---
SELECT "posts".* FROM "posts"