app/controllers/users_controller.rb

  def profile
    @user = set_user
    @user.update(views: @user.views + 1)
---
UPDATE "users" SET "updated_at" = ?, "views" = ? WHERE "users"."id" = ?  [["updated_at", "2023-10-06 08:59:18.976908"], ["views", 1], ["id", 1]]