app/models/comment.rb

  def notify_recipient
    CommentNotification.with(comment: self, post: post).deliver_later(post.user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]